# Aula 14 – Filtrando linhas e colunas no Pandas

Objetivos: aprender como realizar buscas e atribuições específicas com linhas e com colunas nos dataframes criados com o pacote Pandas. Essas técnicas são também conhecidas como **slicing** (do inglês “fatiamento”).
- https://didatica.tech/curso-de-python-para-machine-learning-e-ciencia-de-dados-gratuito/

In [1]:
import pandas as pd

# Dicionário com listas:
alunosDic = {'Nome':['Ricardo', 'Pedro', 'Roberto', 'carlos'],
         'Nota':[4, 7, 5.5, 9],
         'Aprovado':['Não', 'Sim', 'Não', 'sim']}

In [2]:
# Transformar o dicionário em dataframe:
alunosDF = pd.DataFrame(alunosDic)

In [3]:
print(alunosDF)

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não
3   carlos   9.0      sim

In [4]:
# Colunas:
alunosDF['Nome']

0    Ricardo
1      Pedro
2    Roberto
3     carlos
Name: Nome, dtype: object

In [5]:
alunosDF[['Nome', 'Aprovado']]

      Nome Aprovado
0  Ricardo      Não
1    Pedro      Sim
2  Roberto      Não
3   carlos      sim

In [6]:
# Linhas:
alunosDF.loc[[0]]

      Nome  Nota Aprovado
0  Ricardo   4.0      Não

In [7]:
alunosDF.loc[[3]]

     Nome  Nota Aprovado
3  carlos   9.0      sim

In [8]:
alunosDF.loc[[0,3]]

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
3   carlos   9.0      sim

In [9]:
alunosDF.loc[[0,1,3]]

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
3   carlos   9.0      sim

In [10]:
alunosDF.loc[0:2]

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não

In [11]:
alunosDF.loc[:3]

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não
3   carlos   9.0      sim

In [12]:
alunosDF.loc[2:]

      Nome  Nota Aprovado
2  Roberto   5.5      Não
3   carlos   9.0      sim

In [13]:
alunosDF.loc[alunosDF['Nome']=='Pedro']

    Nome  Nota Aprovado
1  Pedro   7.0      Sim

In [14]:
alunosDF.loc[alunosDF['Nota']==9]

     Nome  Nota Aprovado
3  carlos   9.0      sim

In [15]:
alunosDF.loc[alunosDF['Aprovado']=='Não']

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
2  Roberto   5.5      Não

In [16]:
# df[(df["Seminário"] > 8.0) & (df["Prova"] > 3)]
# df[(df['Matemática'] < 6) | (df['Português'] < 6)]

alunosDF.loc[(alunosDF['Aprovado']=='Não') | (alunosDF['Nota'] > 7)]

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
2  Roberto   5.5      Não
3   carlos   9.0      sim